[
   {
      "street":"11651 Chatham Dr #49",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1568,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11651-Chatham-Dr-49-Hampton-GA-30228/346200442_zpid/",
      "county":"Clayton County",
      "buildingStyle":"TOWNHOUSE",
      "description":"The Normandy floor plan at Chatham is the perfect townhome for you! This is a highly desired END UNIT! Luxurious hardwoods throughout the main level lead to an amply sized family room with fireplace. Chefs alike will rejoice when seeing the gourmet kitchen with its stylish grey cabinets, stunning granite countertops, enormous island & separate dining area! Upper level features a huge owner's suite and a plush master bathroom with dual vanity, standing shower & enormous walk-in closet. Two spacious additional bedrooms & hall bathroom with granite countertops round out the upper level! The private backyard will be a hit when hosting family and friends. Awesome amenities include a playground, community pavilion, dog park, and a multi-purpose field! Don't miss out on the opportunity to own in this spectacular GATED community! MOVE IN READY!",
      "yearBuilt":"2024",
      "lotSizeSquareFeet":"5,662 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,568"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"11972 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1405,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11972-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290017_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11972 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 1,405 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $196,650 in April 2022. \n \nThe Zestimate for this house is $250,100. The Rent Zestimate for this home is $1,616/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10142 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":2800,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10142-Cormac-St-Jonesboro-GA-30238/333254342_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10142 Cormac St, Jonesboro, GA 30238 is a single family home that contains 2,800 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $332,202 in April 2022. \n \nThe Zestimate for this house is $366,400. The Rent Zestimate for this home is $2,643/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1445 Farrell Ln",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1445-Farrell-Ln-Hampton-GA-30228/339033085_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"It is often said the most important word in real estate is location and Creekstone is second to none! Just off Tara Blvd. with direct access to interstates, you can enjoy convenient dining, shopping and everything metro Atlanta has to offer. Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"305 Willow Springs Dr",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":1503,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/305-Willow-Springs-Dr-Jonesboro-GA-30238/54715297_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Take a look at this beautiful home featuring 3 bedrooms, 2.0 bathrooms, and approximately 1,503 square feet. Enjoy the freedom of a virtually maintenance free lifestyle while residing in a great community. This home is professionally managed and maintained by Tricon Residential. \n\n - Please beware of leasing fraud! If someone other than an official Tricon Residential leasing agent attempts to rent you a home that is owned and professionally managed by Tricon Residential, please call our Fraud Prevention Hotline at 877.241.\n - There is an application fee of $55 per occupant aged 18 or older. Completed applications are considered on a \"first-come, first-served\" basis. There is a holding deposit of $250 per home, which is credited to the approved applicant\\'s first month\\'s rent after move-in, refunded if the application is denied, or forfeited if the move-in is canceled by an approved applicant. Approved applicants are required to execute a Lease Agreement and submit the full security deposit within 48 hours after approval of the Lease. The Lease start date must be within 10 days after approval (certain exceptions may apply at Tricon Single-Family Rental Communities). This requirement is applicable even if an approved applicant has not seen the inside of the home. Tricon Residential is proud to be an Equal Opportunity Housing Provider.\n - Minimum lease term is one-year (13 mos. for homes in California). Security deposit varies based upon credit criteria; however standard security deposit equals one month\\'s rent. Resident pays for all utilities including trash, sewer, and water.\n - Animals approved with pet fee (except for new leases in California) and monthly pet rent. The following dog breeds and types, whether full or mixed, are prohibited: American Pit Bull Terrier, American Staffordshire Terrier, Bull Mastiff, Cane Corso, Chow, Doberman, Dogo Argentino, Pit Bull, Presa Canario, Rottweiler, Wolf, Wolf hybrids, any combination mix of the foregoing breeds, and any other breed or type that Landlord deems to have similar characteristics. Maximum of two animals allowed per home.\n - Pricing displayed reflects the lowest option for a given lease term and is deemed reliable but not guaranteed. Actual pricing will vary based on the options selected. We may revise the pricing for products and services we offer without prior notice.\n - A Pool Maintenance Fee of $150 per month applies to any home with a pool. A Smart Home Fee of $21.95 per month applies to any home with Smart Home technology. A monthly Solar Fee will apply to certain homes equipped with a solar system; the fee varies by home. The energy generated by the solar systems can result in a credit to offset utility costs. An administrative fee is due prior to move-in. Other mandatory fees or charges may apply; review the Lease carefully for a full list of applicable fees and charges.\n - All Promotions are subject to the specific terms, conditions, and restrictions disclosed in connection therewith, and are subject to being changed or discontinued without notice. Photos are representative only and may not reflect the home\\'s current appliances or other features. If you have specific questions about a home\\'s features, please contact us. While we strive for accuracy, pricing, availability, and other listing information may include technical inaccuracies or typographical errors.\n - Other terms and conditions apply. Refer to our online Terms of Agreement for more details.\n- A fee of $35.00 per month will be included in your monthly Services and Amenities fee when a washer and dryer is installed.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"2553 Cornerstone Blvd #100",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2182,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/2553-Cornerstone-Blvd-100-Hampton-GA-30228/2067581197_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Cornerstone/ Joanna Plan- This amazing home includes a bedroom on the main level with a full bath, opening into your large kitchen and a separate dining area. Our homes include beautiful granite countertops and a stainless steel appliance package. The second level includes 3 additional bedrooms and the over sized owner's suite with a sitting area with a large walk in closet, separate tub and shower and dual vanity. New construction completion date March 2022",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,182"
   },
   {
      "street":"12226 Florin St",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-Hampton-GA-30228/250287830_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"12226 Florin St, Hampton, GA 30228 is a single family home that contains 2,221 sq ft and was built in 2022. It contains 4 bedrooms and 3 bathrooms. This home last sold for $325,794 in March 2022. \n \nThe Zestimate for this house is $337,900. The Rent Zestimate for this home is $2,326/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"10125 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3070,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10125-Cormac-St-Jonesboro-GA-30238/333254266_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"The Exquisite Everest III Plan built by Dan Ryan Builders at The Lake At Mundy's Mill features 5 bedrooms, 3 full bath home. The upper level features a HUGE owner suite with a sitting room, huge walk-in closet, garden tub with separate tiled shower, double vanity. Three additional bedrooms with hallway bath. Fifth bedroom on the main with full bath. Kitchen with granite counter top, huge island and great breakfast area, open to great room with fireplace. Formal dining room with coffered ceiling and living room completes the main floor. This home also includes the luxury vinyl on the stairs.  THIS LISTING INCLUDES STOCK PHOTOS OF THE SAME FLOOR PLAN",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"3,070"
   },
   {
      "street":"6967 Knollwood Dr",
      "city":"Morrow",
      "state":"GA",
      "zip":"30260",
      "livingArea":1802,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/6967-Knollwood-Dr-Morrow-GA-30260/250290664_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"New Construction! Beautiful 3 bedrooms, 1 study room and 2 bath Ranch-Style Home. The study room with closet can be converted into 4th Bedroom. This house has OPEN FLOOR PLAN - connecting the kitchen, living, and dining room, making this home the perfect entertainer's home. Each Bedroom has a walk in closet. The Master Bedroom has an oversized bathroom and large closet. DonÆt miss out on your dream home!!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.30 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,802"
   },
   {
      "street":"1305 Bugle Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1580,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1305-Bugle-Ct-Hampton-GA-30228/35805817_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Discover the lifestyle of your dreams at Sun City Peachtree. This Del Webb Georgia 55+ community keeps the \"active\" in active adult with world-class amenities, while an array of clubs and events foster a strong sense of community. Its stunning collection of new homes boast one-level living built for entertaining with open concept floor plans and cleverly realized indoor/outdoor living spaces.",
      "yearBuilt":"2023",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"12226 Florin St LOT 40; APPROX SQ FT 2221",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2221,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/12226-Florin-St-LOT-40-APPROX-SQ-FT-2221-Hampton-GA-30228/402140904_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"~~~~~~~~~~~~~~~~~~~BACK ON THE MARKET~~~~~~~~~~~~~~~~~     4 Sided Brick Home! Granite Counter; Beautiful Owner's Suite Bedroom; Bedroom on Main, Loft...AND SO MUCH MORE!  Expected time of completion May/June 2022.  ~Stock Photos~",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.25 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,221"
   },
   {
      "street":"11960 Lovejoy Crossing Pl",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":804,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/11960-Lovejoy-Crossing-Pl-Hampton-GA-30228/250290020_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"11960 Lovejoy Crossing Pl, Hampton, GA 30228 is a single family home that contains 804 sq ft and was built in 2022. It contains 3 bedrooms and 1 bathroom. This home last sold for $186,900 in March 2022. \n \nThe Zestimate for this house is $215,800. The Rent Zestimate for this home is $1,389/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"112 Elaine Ter",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30236",
      "livingArea":1860,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/112-Elaine-Ter-Jonesboro-GA-30236/250288767_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"This is it, you can't get it better than this! New construction in an established neighborhood. This house comes with all the bells and whistles. All new SSA, LVP Flooring all over living area, Granite in Kitchen and baths. This builder did not cut corners. This 3 BR and 2.5 baths, 2 car garage with bonus office space is a dream comes true. All electric!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"0.57 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"1,860"
   },
   {
      "street":"10119 Cormac St",
      "city":"Jonesboro",
      "state":"GA",
      "zip":"30238",
      "livingArea":3199,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/10119-Cormac-St-Jonesboro-GA-30238/333254422_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"10119 Cormac St, Jonesboro, GA 30238 is a single family home that contains 3,199 sq ft and was built in 2022. It contains 5 bedrooms and 3 bathrooms. This home last sold for $354,796 in March 2022. \n \nThe Zestimate for this house is $375,200. The Rent Zestimate for this home is $2,581/mo. ",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1,306 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"13663 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2367,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13663-Inman-Rd-Hampton-GA-30228/250287657_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Don't miss out on this rare opportunity to own a piece of serenity with all the modern conveniences included!     Welcome to this charming 3-bedroom, 3-full bathroom home nestled in a peaceful rural cul-de-sac.    The downstairs level welcomes you with a sizeable flex room that can be utilized as an additional guest space, study, office, or for entertainment. It also features double doors for added privacy and versatility.     The open concept design seamlessly connects the kitchen to the living room area, creating a perfect space for gatherings. You will also have a full bathroom on the downstairs level for guests and convenience.     Upstairs, you'll find the primary ensuite with his and hers closets, a double sink vanity, two secondary bedrooms, a hallway bathroom, and a convenient laundry room.     Buyers will be pleased that the purchase includes a modern GE washer and dryer set, a full set of stainless-steel kitchen appliances, a whole house water filtration system with water softener for added convenience.     Newly built just 2 years ago in March, this home presents a modern and fresh living space ready for your special touches.     DonÆt let this opportunity pass. Schedule a showing today!  Sold As-Is and Move-in ready!",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"1.51 Acres",
      "rental":false,
      "totalBuildingAreaSquareFeet":"2,367"
   },
   {
      "street":"13675 Inman Rd",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":2482,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/13675-Inman-Rd-Hampton-GA-30228/250287658_zpid/",
      "county":"Clayton County",
      "buildingStyle":"LOT",
      "description":"Nice and ready lot backs up to the Flint River. Its the perfect time to start building your dream home!  Additional lots available, call for more details.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"None",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   },
   {
      "street":"1488 Townsend Ct",
      "city":"Hampton",
      "state":"GA",
      "zip":"30228",
      "livingArea":1991,
      "status":"SOLD",
      "detailUrl":"https://www.zillow.com/homedetails/1488-Townsend-Ct-Hampton-GA-30228/339033083_zpid/",
      "county":"Clayton County",
      "buildingStyle":"SINGLE_FAMILY",
      "description":"Built for the way you live, this incredible design offers an open concept kitchen and family room. Cabinet color options include gray, white and espresso. A flex room on the main is the perfect space for a home office or dedicated formal dining room. Upstairs features a gracious bedroom suite with spa-like bath, generous secondary bedrooms with extra storage, plus a convenient laundry. And you will never be too far from home with Home Is Connected.« Your new home is built with an industry leading suite of smart home products that keep you connected with the people and place you value most. Photos used for illustrative purposes and do not depict actual home.",
      "yearBuilt":"2022",
      "lotSizeSquareFeet":"3,049 sqft",
      "rental":false,
      "totalBuildingAreaSquareFeet":"None"
   }
]